tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
brew "awscli"
brew "gawk"
brew "gnupg"
brew "gpg"
brew "mplayer"
brew "mkcert"
brew "nvm"
brew "pnpm"
brew "pyenv"
brew "romkatv/powerlevel10k/powerlevel10k"
# cask "firefox"
# cask "android-studio"
# cask "cocoapods"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "flutter"
cask "font-hack-nerd-font"
cask "github"
cask "google-chrome"
cask "insomnia"
cask "postman"
cask "iterm2"
cask "sourcetree"
cask "sublime-text"
cask "visual-studio-code"
cask "vlc"