############################################
# TAPS
############################################

tap "buo/cask-upgrade"                        # Gerencia atualizações de casks com 'brew cu'
tap "romkatv/powerlevel10k"                  # Tema Powerlevel10k para Zsh

############################################
# BREWS (Pacotes de terminal)
############################################

brew "awscli"                                # CLI da AWS
brew "gawk"                                  # GNU awk (útil em scripts)
brew "gnupg"                                 # GPG para assinaturas e criptografia
brew "mkcert"                                # Criação fácil de certificados SSL locais
brew "nvm"                                   # Node Version Manager (útil para dev JS)
brew "pnpm"                                  # Gerenciador de pacotes rápido para Node.js
brew "pyenv"                                 # Gerencia versões do Python

############################################
# CASKS (Apps gráficos)
############################################

# cask "google-chrome"                       # Mantenha se for seu navegador principal
# cask "firefox"                             # Mantenha se quiser um navegador alternativo
# cask "android-studio"                      # Mantenha se desenvolver para Android
# cask "cocoapods"                           # ⚠️ CLI, melhor instalar com `brew install cocoapods`
# cask "flutter"                             # CLI, use `brew install flutter` se preferir manter tudo como `brew`
# cask "docker"                              # ⚠️ Docker Desktop tem uso gratuito limitado p/ empresas
cask "dbeaver-community"                     # Cliente de banco de dados
cask "discord"                               # Chat/voz (muito usado em comunidades dev)
cask "font-hack-nerd-font"                   # Fonte Nerd Font (necessita o tap `homebrew/cask-fonts`)
cask "insomnia"                              # Teste de APIs
cask "postman"                               # Teste de APIs
cask "iterm2"                                # Terminal avançado
cask "sublime-text"                          # Editor de texto rápido
cask "visual-studio-code"                    # Editor principal (VSCode)
cask "cursor"                                # Editor AI-based estilo VSCode
cask "microsoft-teams"                       # Comunicação corporativa
cask "vlc"                                   # Reprodutor de mídia
cask "google-drive"
cask "spotify"
cask "openvpn-connect"
